# IFCExtrusionCalculatorUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCalculatorUtils Class
Members See Also
---
A utility class used to calculate extrusion data from Revit geometry for IFC export.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class IFCExtrusionCalculatorUtils
```

Visual Basic
---
```text
Public NotInheritable Class IFCExtrusionCalculatorUtils
```

Visual C++
---
```text
public ref class IFCExtrusionCalculatorUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCExtrusionCalculatorUtils
# See Also
IFCExtrusionCalculatorUtils Members
Autodesk.Revit.DB.IFC Namespace